app/views/users/index.html.erb

            <p class="card-text">
              <%= pluralize(user.articles.count,"article") %>
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]