app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)

INSERT INTO "articles" ("title", "created_at", "updated_at", "description", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "llllllllll"], ["created_at", "2024-03-28 03:22:55.152209"], ["updated_at", "2024-03-28 03:22:55.152209"], ["description", "lll"], ["user_id", nil]]
---
  def create
    # render plain: params[:article]
    @article = Article.new(article_params)
    @article.user_id = 1
    if @article.save

UPDATE "articles" SET "title" = $1, "updated_at" = $2, "description" = $3 WHERE "articles"."id" = $4  [["title", "postger"], ["updated_at", "2024-03-15 07:14:59.685620"], ["description", "mm "], ["id", 4]]
---
  def update
    if @article.update(article_params)