app/controllers/users_controller.rb

  def show
    @articles = @user.articles.sorted.paginate(page: params[:page], per_page: 5)
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 6], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]